# PropertySegmentEW Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySegmentEW Property
ParameterTypeId Class See Also
---
"E/W"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySegmentEW { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySegmentEW As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySegmentEW {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace